app/controllers/user_items_controller.rb

  def index
    @user_items = UserItem.all
---
SELECT "user_items".* FROM "user_items"