app/controllers/users_controller.rb

INSERT INTO "users" ("username", "password_digest", "email", "phone_number", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
  @user = User.create(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
---
  def get_user
    token = request.headers["authorization"]
    # byebug
    id = JWT.decode(token, "secret")[0]["user_id"]
    @user = User.find(id)